function C_SELECT_ONE() {
	this.ary_anser_pattern__ = new Array(
		0x0123, 0x0132, 0x0213, 0x0231, 0x0312, 0x0321,
		0x1023, 0x1032, 0x1203, 0x1230, 0x1302, 0x1320,
		0x2103, 0x2130, 0x2013, 0x2031, 0x2310, 0x2301,
		0x3120, 0x3102, 0x3210, 0x3201, 0x3012, 0x3021
	);
	this.question_num__ = 10;
	this.ary_question__ = new Array(
		[
			"ñkäCìπÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ê∂ì˚",
			"ïƒ",
			"ì˜ópãç",
			"ÇŒÇÍÇ¢ÇµÇÂ",
			"ê∂ì˚3,224 ïƒ1,301 ì˜ópãç814 ÇŒÇÍÇ¢ÇµÇÂ668 ì˚ãç553(íPà ÅFâ≠â~)"
		],
		[
			"ê¬êXÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ÇËÇÒÇ≤",
			"ïƒ",
			"ìÿ",
			"ÉuÉçÉCÉâÅ[",
			"ÇËÇÒÇ≤733 ïƒ508 ìÿ238 ÉuÉçÉCÉâÅ[187 å{óë169(íPà ÅFâ≠â~)"
		],
		[
			"ä‚éËÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"ÉuÉçÉCÉâÅ[",
			"ìÿ",
			"ê∂ì˚",
			"ïƒ600 ÉuÉçÉCÉâÅ[497 ìÿ274 ê∂ì˚214 ì˜ópãç200(íPà ÅFâ≠â~)"
		],
		[
			"ã{èÈÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"ì˜ópãç",
			"å{óë",
			"ê∂ì˚",
			"ïƒ792 ì˜ópãç202 å{óë164 ê∂ì˚122 ìÿ116(íPà ÅFâ≠â~)"
		],
		[
			"èHìcÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"ìÿ",
			"å{óë",
			"ì˜ópãç",
			"ïƒ1,012 ìÿ171 å{óë60 ì˜ópãç46 ÇËÇÒÇ≤45(íPà ÅFâ≠â~)"
		],
		[
			"éRå`ÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"Ç®Ç§Ç∆Ç§",
			"ìÿ",
			"ÇËÇÒÇ≤",
			"ïƒ867 Ç®Ç§Ç∆Ç§308 ìÿ121 ÇËÇÒÇ≤106 ì˜ópãç103(íPà ÅFâ≠â~)"
		],
		[
			"ïüìáÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"Ç´Ç„Ç§ÇË",
			"å{óë",
			"ì˜ópãç",
			"ïƒ754 Ç´Ç„Ç§ÇË123 å{óë115 ì˜ópãç108 Ç‡Ç‡102(íPà ÅFâ≠â~)"
		],
		[
			"àÔèÈÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"å{óë",
			"ìÿ",
			"Ç©ÇÒÇµÇÂ",
			"ïƒ875 å{óë402 ìÿ375 Ç©ÇÒÇµÇÂ173 ê∂ì˚156(íPà ÅFâ≠â~)"
		],
		[
			"ì»ñÿÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"ê∂ì˚",
			"ìÿ",
			"Ç¢ÇøÇ≤",
			"ïƒ685 ê∂ì˚307 ìÿ261 Ç¢ÇøÇ≤250 ì˜ópãç187(íPà ÅFâ≠â~)"
		],
		[
			"åQînÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ìÿ",
			"ê∂ì˚",
			"ÉLÉÉÉxÉc",
			"ïƒ",
			"ìÿ357 ê∂ì˚237 ÉLÉÉÉxÉc182 ïƒ162 Ç´Ç„Ç§ÇË142(íPà ÅFâ≠â~)"
		],
		[
			"çÈã ÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"ÇÀÇ¨",
			"Ç´Ç„Ç§ÇË",
			"ÇŸÇ§ÇÍÇÒÇªÇ§",
			"ïƒ403 ÇÀÇ¨194 Ç´Ç„Ç§ÇË146 ÇŸÇ§ÇÍÇÒÇªÇ§125 å{óë102(íPà ÅFâ≠â~)"
		],
		[
			"êÁótÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"ìÿ",
			"å{óë",
			"ê∂ì˚",
			"ïƒ710 ìÿ407 å{óë326 ê∂ì˚236 ÇÀÇ¨183(íPà ÅFâ≠â~)"
		],
		[
			"ìåãûÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"Ç±Ç‹Ç¬Ç»",
			"ÇŸÇ§ÇÍÇÒÇªÇ§",
			"ì˙ñ{Ç»Çµ",
			"ÉgÉ}Ég",
			"Ç±Ç‹Ç¬Ç»25 ÇŸÇ§ÇÍÇÒÇªÇ§17 ì˙ñ{Ç»Çµ16 ÉgÉ}Ég15 êÿÇËót12(íPà ÅFâ≠â~)"
		],
		[
			"ê_ìﬁêÏÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ÇæÇ¢Ç±ÇÒ",
			"ÉLÉÉÉxÉc",
			"ê∂ì˚",
			"ìÿ",
			"ÇæÇ¢Ç±ÇÒ94 ÉLÉÉÉxÉc68 ê∂ì˚51 ìÿ44 å{óë42(íPà ÅFâ≠â~)"
		],
		[
			"êVäÉÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"å{óë",
			"ìÿ",
			"ê∂ì˚",
			"ïƒ1,499 å{óë214 ìÿ155 ê∂ì˚63 ÇæÇ¢Ç±ÇÒ45(íPà ÅFâ≠â~)"
		],
		[
			"ïxéRÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"å{óë",
			"ìÿ",
			"ê∂ì˚",
			"ïƒ446 å{óë41 ìÿ21 ê∂ì˚13 ì˜ópãç12(íPà ÅFâ≠â~)"
		],
		[
			"êŒêÏÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"å{óë",
			"ê∂ì˚",
			"Ç∑Ç¢Ç©",
			"ïƒ284 å{óë36 ê∂ì˚24 Ç∑Ç¢Ç©18 ìÿ17(íPà ÅFâ≠â~)"
		],
		[
			"ïüà‰ÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"å{óë",
			"ê∂ì˚",
			"Ç≥Ç∆Ç¢Ç‡",
			"ïƒ274 å{óë22 ê∂ì˚8 Ç≥Ç∆Ç¢Ç‡8 ì˜ópãç7(íPà ÅFâ≠â~)"
		],
		[
			"éRóúÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"Ç‘Ç«Ç§",
			"Ç‡Ç‡",
			"ïƒ",
			"Ç®Ç§Ç∆Ç§",
			"Ç‘Ç«Ç§269 Ç‡Ç‡155 ïƒ68 Ç®Ç§Ç∆Ç§34 Ç∑Ç‡Ç‡27(íPà ÅFâ≠â~)"
		],
		[
			"í∑ñÏÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"ÇËÇÒÇ≤",
			"ÉåÉ^ÉX",
			"ÇÕÇ≠Ç≥Ç¢",
			"ïƒ491 ÇËÇÒÇ≤273 ÉåÉ^ÉX247 ÇÕÇ≠Ç≥Ç¢144 Ç‘Ç«Ç§132(íPà ÅFâ≠â~)"
		],
		[
			"äÚïåÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"å{óë",
			"ì˜ópãç",
			"ÉgÉ}Ég",
			"ïƒ256 å{óë127 ì˜ópãç97 ÉgÉ}Ég72 ìÿ65(íPà ÅFâ≠â~)"
		],
		[
			"ê√â™ÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"íÉÅiê∂ótÅj",
			"Ç›Ç©ÇÒ",
			"ïƒ",
			"å{óë",
			"íÉÅiê∂ótÅj 241 Ç›Ç©ÇÒ236 ïƒ200 å{óë138 çríÉ132(íPà ÅFâ≠â~)"
		],
		[
			"à§ímÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"ÉLÉÉÉxÉc",
			"ìÿ",
			"Ç´Ç≠",
			"ïƒ310 ÉLÉÉÉxÉc236 ìÿ228 Ç´Ç≠213 å{óë204(íPà ÅFâ≠â~)"
		],
		[
			"éOèdÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"å{óë",
			"ì˜ópãç",
			"ìÿ",
			"ïƒ303 å{óë131 ì˜ópãç68 ìÿ66 ê∂ì˚56(íPà ÅFâ≠â~)"
		],
		[
			"é†âÍÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"ì˜ópãç",
			"ê∂ì˚",
			"å{óë",
			"ïƒ377 ì˜ópãç54 ê∂ì˚25 å{óë19 ëÂì§11(íPà ÅFâ≠â~)"
		],
		[
			"ãûìsÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"å{óë",
			"íÉÅiê∂ótÅj",
			"ê∂ì˚",
			"ïƒ185 å{óë54 íÉÅiê∂ótÅj 42 ê∂ì˚34 çríÉ31(íPà ÅFâ≠â~)"
		],
		[
			"ëÂç„ÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"Ç‘Ç«Ç§",
			"ÇÀÇ¨",
			"Ç»Ç∑",
			"ïƒ81 Ç‘Ç«Ç§35 ÇÀÇ¨23 Ç»Ç∑21 Ç›Ç©ÇÒ15(íPà ÅFâ≠â~)"
		],
		[
			"ï∫å…ÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"å{óë",
			"ì˜ópãç",
			"ê∂ì˚",
			"ïƒ440 å{óë162 ì˜ópãç118 ê∂ì˚100 ÇΩÇ‹ÇÀÇ¨90(íPà ÅFâ≠â~)"
		],
		[
			"ìﬁó«ÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"Ç©Ç´",
			"ê∂ì˚",
			"Ç¢ÇøÇ≤",
			"ïƒ110 Ç©Ç´64 ê∂ì˚28 Ç¢ÇøÇ≤18 ÇŸÇ§ÇÍÇÒÇªÇ§18(íPà ÅFâ≠â~)"
		],
		[
			"òaâÃéRÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"Ç›Ç©ÇÒ",
			"Ç§Çﬂ",
			"ïƒ",
			"Ç©Ç´",
			"Ç›Ç©ÇÒ248 Ç§Çﬂ134 ïƒ89 Ç©Ç´89 Ç‡Ç‡45(íPà ÅFâ≠â~)"
		],
		[
			"íπéÊÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"ÉuÉçÉCÉâÅ[",
			"ê∂ì˚",
			"ì˙ñ{Ç»Çµ",
			"ïƒ154 ÉuÉçÉCÉâÅ[67 ê∂ì˚58 ì˙ñ{Ç»Çµ53 ìÿ51(íPà ÅFâ≠â~)"
		],
		[
			"ìáç™ÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"ê∂ì˚",
			"ì˜ópãç",
			"å{óë",
			"ïƒ234 ê∂ì˚67 ì˜ópãç66 å{óë36 ìÿ25(íPà ÅFâ≠â~)"
		],
		[
			"â™éRÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"å{óë",
			"Ç‘Ç«Ç§",
			"ê∂ì˚",
			"ïƒ319 å{óë227 Ç‘Ç«Ç§113 ê∂ì˚100 ì˜ópãç73(íPà ÅFâ≠â~)"
		],
		[
			"çLìáÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"å{óë",
			"ì˜ópãç",
			"Ç›Ç©ÇÒ",
			"ïƒ269 å{óë239 ì˜ópãç67 Ç›Ç©ÇÒ62 ê∂ì˚60(íPà ÅFâ≠â~)"
		],
		[
			"éRå˚ÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"å{óë",
			"ì˜ópãç",
			"ÉuÉçÉCÉâÅ[",
			"ïƒ253 å{óë62 ì˜ópãç37 ÉuÉçÉCÉâÅ[31 ê∂ì˚20(íPà ÅFâ≠â~)"
		],
		[
			"ìøìáÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"ÉuÉçÉCÉâÅ[",
			"Ç©ÇÒÇµÇÂ",
			"ì˜ópãç",
			"ïƒ128 ÉuÉçÉCÉâÅ[79 Ç©ÇÒÇµÇÂ69 ì˜ópãç60 Ç…ÇÒÇ∂ÇÒ58(íPà ÅFâ≠â~)"
		],
		[
			"çÅêÏÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"å{óë",
			"ÉåÉ^ÉX",
			"ÉuÉçÉCÉâÅ[",
			"ïƒ133 å{óë125 ÉåÉ^ÉX44 ÉuÉçÉCÉâÅ[41 ì˜ópãç38(íPà ÅFâ≠â~)"
		],
		[
			"à§ïQÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"Ç›Ç©ÇÒ",
			"ïƒ",
			"ìÿ",
			"å{óë",
			"Ç›Ç©ÇÒ237 ïƒ168 ìÿ132 å{óë62 Ç¢ÇÊÇ©ÇÒ56(íPà ÅFâ≠â~)"
		],
		[
			"çÇímÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"Ç»Ç∑",
			"Ç›ÇÂÇ§Ç™",
			"Ç…ÇÁ",
			"ïƒ117 Ç»Ç∑92 Ç›ÇÂÇ§Ç™65 Ç…ÇÁ64 Ç´Ç„Ç§ÇË63(íPà ÅFâ≠â~)"
		],
		[
			"ïüâ™ÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"Ç¢ÇøÇ≤",
			"å{óë",
			"ê∂ì˚",
			"ïƒ446 Ç¢ÇøÇ≤204 å{óë135 ê∂ì˚89 ÉgÉ}Ég67(íPà ÅFâ≠â~)"
		],
		[
			"ç≤âÍÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"ì˜ópãç",
			"Ç›Ç©ÇÒ",
			"ÇΩÇ‹ÇÀÇ¨",
			"ïƒ256 ì˜ópãç130 Ç›Ç©ÇÒ110 ÇΩÇ‹ÇÀÇ¨96 Ç¢ÇøÇ≤93(íPà ÅFâ≠â~)"
		],
		[
			"í∑çËÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ì˜ópãç",
			"ïƒ",
			"ìÿ",
			"ÇŒÇÍÇ¢ÇµÇÂ",
			"ì˜ópãç197 ïƒ141 ìÿ124 ÇŒÇÍÇ¢ÇµÇÂ98 Ç¢ÇøÇ≤95(íPà ÅFâ≠â~)"
		],
		[
			"åFñ{ÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ÉgÉ}Ég",
			"ïƒ",
			"ì˜ópãç",
			"ê∂ì˚",
			"ÉgÉ}Ég410 ïƒ403 ì˜ópãç326 ê∂ì˚243 ìÿ191(íPà ÅFâ≠â~)"
		],
		[
			"ëÂï™ÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ïƒ",
			"ì˜ópãç",
			"ìÿ",
			"ê∂ì˚",
			"ïƒ265 ì˜ópãç123 ìÿ86 ê∂ì˚81 ÇÀÇ¨66(íPà ÅFâ≠â~)"
		],
		[
			"ã{çËÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ÉuÉçÉCÉâÅ[",
			"ì˜ópãç",
			"ìÿ",
			"ïƒ",
			"ÉuÉçÉCÉâÅ[592 ì˜ópãç527 ìÿ468 ïƒ204 Ç´Ç„Ç§ÇË181(íPà ÅFâ≠â~)"
		],
		[
			"é≠éôìáÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ì˜ópãç",
			"ìÿ",
			"ÉuÉçÉCÉâÅ[",
			"å{óë",
			"ì˜ópãç880 ìÿ695 ÉuÉçÉCÉâÅ[539 å{óë266 ïƒ241(íPà ÅFâ≠â~)"
		],
		[
			"â´ìÍÇÃî_ã∆éYèoäzÇ™ç≈Ç‡çÇÇ¢Ç‡ÇÃÇÕÅH(ïΩê¨25)",
			"ì˜ópãç",
			"Ç≥Ç∆Ç§Ç´Ç—",
			"ìÿ",
			"Ç´Ç≠",
			"ì˜ópãç158 Ç≥Ç∆Ç§Ç´Ç—151 ìÿ123 Ç´Ç≠71 å{óë53(íPà ÅFâ≠â~)"
		]
	);
    this.ary_table_color__ = new Array("#A0A0A0", "#FFFFFF");
};
C_SELECT_ONE.prototype.sttc_Init = function() {
	if( this.question_num__ > this.ary_anser_pattern__.length )
	{
		this.question_num__ = this.ary_anser_pattern__.length;
	}
	var q_length;
	var xc_id;
	var tmp;
	q_length = this.ary_question__.length;

	for( i = 0; i < q_length; i ++ )
	{
		xc_id = ns_myRand.GetRand() % ( q_length - i ) + i;
		tmp = this.ary_question__[ xc_id ];
		this.ary_question__[ xc_id ] = this.ary_question__[ i ];
		this.ary_question__[ i ] = tmp;
	}
};

C_SELECT_ONE.prototype.sttc_MakeQuestion = function( question_no, flag_anser ) {
	var pattern24 = 0;
	var pattern_id = 0;
	var pattern_num;
	var rd;
	var i;
	var ans_id = 0;

	rd = ns_myRand.GetRand();
	pattern_num = this.ary_anser_pattern__.length;
	pattern24 = this.ary_anser_pattern__[ ns_myRand.GetRand() % pattern_num ];

	document.write( this.ary_question__[ question_no ][ 0 ], "<br>" );
	for( i = 0; i < 4; i ++ )
	{
		pattern_id = ( ( pattern24 >> ( i << 2 ) ) & 3 ) + 1;

		document.write("<p>");
		if( flag_anser && pattern_id == 1 )
		{
			document.write("<div class='test_anser'>");
		}
		document.write( "", i + 1, ". ", this.ary_question__[ question_no ][ pattern_id ] );
		if( flag_anser && pattern_id == 1 )
		{
			document.write("</div>");
			ans_id = i + 1;
		}
			document.write( "</p>" );
	}
	if( flag_anser )
	{
		document.write( "<br>" );
		document.write("<div class='test_anser'>");
		document.write( "<p>[âìö] ", ans_id,"</p>" );
		document.write( "<p>", this.ary_question__[ question_no ][ 5 ], "</p>" );
		document.write("</div>");
	}
};
C_SELECT_ONE.prototype.sttc_DispTable = function(flag_anser) {
	var i;
	document.write( "<p>ñ‚ëËëçêî:", this.ary_question__.length, ", èoëËêî:", this.question_num__, "</p>" );
	for( i = 0; i < this.question_num__; i ++ )
	{
		document.write( "<hr><p>ëÊ", i + 1, "ñ‚</p>" );
		this.sttc_MakeQuestion( i, flag_anser );
	}
};
C_SELECT_ONE.prototype.Test_SelectOne = function(flag_anser) {
	this.sttc_Init();
    this.sttc_DispTable(flag_anser);
    if (flag_anser != 0) {
    }
};
